{
  "format": "layers-model",
  "generatedBy": "keras v2.19.0",
  "convertedBy": "TensorFlow.js Converter v4.22.0",
  "modelTopology": {
    "keras_version": "2.19.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Functional",
      "config": {
        "name": "model_inf",
        "trainable": true,
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                15,
                15,
                15,
                1
              ],
              "dtype": "float32",
              "name": "patch_s0"
            },
            "name": "patch_s0",
            "inbound_nodes": []
          },
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                15,
                15,
                15,
                1
              ],
              "dtype": "float32",
              "name": "patch_s1"
            },
            "name": "patch_s1",
            "inbound_nodes": []
          },
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                15,
                15,
                15,
                1
              ],
              "dtype": "float32",
              "name": "patch_s2"
            },
            "name": "patch_s2",
            "inbound_nodes": []
          },
          {
            "class_name": "Conv3D",
            "config": {
              "name": "conv3d",
              "trainable": true,
              "dtype": "float32",
              "filters": 32,
              "kernel_size": [
                3,
                3,
                3
              ],
              "strides": [
                1,
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1,
                1
              ],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv3d",
            "inbound_nodes": [
              [
                [
                  "patch_s0",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Conv3D",
            "config": {
              "name": "conv3d_3",
              "trainable": true,
              "dtype": "float32",
              "filters": 32,
              "kernel_size": [
                3,
                3,
                3
              ],
              "strides": [
                1,
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1,
                1
              ],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv3d_3",
            "inbound_nodes": [
              [
                [
                  "patch_s1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Conv3D",
            "config": {
              "name": "conv3d_6",
              "trainable": true,
              "dtype": "float32",
              "filters": 32,
              "kernel_size": [
                3,
                3,
                3
              ],
              "strides": [
                1,
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1,
                1
              ],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv3d_6",
            "inbound_nodes": [
              [
                [
                  "patch_s2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "MaxPooling3D",
            "config": {
              "name": "max_pooling3d",
              "trainable": true,
              "dtype": "float32",
              "pool_size": [
                2,
                2,
                2
              ],
              "padding": "valid",
              "strides": [
                2,
                2,
                2
              ],
              "data_format": "channels_last"
            },
            "name": "max_pooling3d",
            "inbound_nodes": [
              [
                [
                  "conv3d",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "MaxPooling3D",
            "config": {
              "name": "max_pooling3d_2",
              "trainable": true,
              "dtype": "float32",
              "pool_size": [
                2,
                2,
                2
              ],
              "padding": "valid",
              "strides": [
                2,
                2,
                2
              ],
              "data_format": "channels_last"
            },
            "name": "max_pooling3d_2",
            "inbound_nodes": [
              [
                [
                  "conv3d_3",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "MaxPooling3D",
            "config": {
              "name": "max_pooling3d_4",
              "trainable": true,
              "dtype": "float32",
              "pool_size": [
                2,
                2,
                2
              ],
              "padding": "valid",
              "strides": [
                2,
                2,
                2
              ],
              "data_format": "channels_last"
            },
            "name": "max_pooling3d_4",
            "inbound_nodes": [
              [
                [
                  "conv3d_6",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Conv3D",
            "config": {
              "name": "conv3d_1",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [
                3,
                3,
                3
              ],
              "strides": [
                1,
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1,
                1
              ],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv3d_1",
            "inbound_nodes": [
              [
                [
                  "max_pooling3d",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Conv3D",
            "config": {
              "name": "conv3d_4",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [
                3,
                3,
                3
              ],
              "strides": [
                1,
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1,
                1
              ],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv3d_4",
            "inbound_nodes": [
              [
                [
                  "max_pooling3d_2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Conv3D",
            "config": {
              "name": "conv3d_7",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [
                3,
                3,
                3
              ],
              "strides": [
                1,
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1,
                1
              ],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv3d_7",
            "inbound_nodes": [
              [
                [
                  "max_pooling3d_4",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "MaxPooling3D",
            "config": {
              "name": "max_pooling3d_1",
              "trainable": true,
              "dtype": "float32",
              "pool_size": [
                2,
                2,
                2
              ],
              "padding": "valid",
              "strides": [
                2,
                2,
                2
              ],
              "data_format": "channels_last"
            },
            "name": "max_pooling3d_1",
            "inbound_nodes": [
              [
                [
                  "conv3d_1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "MaxPooling3D",
            "config": {
              "name": "max_pooling3d_3",
              "trainable": true,
              "dtype": "float32",
              "pool_size": [
                2,
                2,
                2
              ],
              "padding": "valid",
              "strides": [
                2,
                2,
                2
              ],
              "data_format": "channels_last"
            },
            "name": "max_pooling3d_3",
            "inbound_nodes": [
              [
                [
                  "conv3d_4",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "MaxPooling3D",
            "config": {
              "name": "max_pooling3d_5",
              "trainable": true,
              "dtype": "float32",
              "pool_size": [
                2,
                2,
                2
              ],
              "padding": "valid",
              "strides": [
                2,
                2,
                2
              ],
              "data_format": "channels_last"
            },
            "name": "max_pooling3d_5",
            "inbound_nodes": [
              [
                [
                  "conv3d_7",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Conv3D",
            "config": {
              "name": "conv3d_2",
              "trainable": true,
              "dtype": "float32",
              "filters": 96,
              "kernel_size": [
                3,
                3,
                3
              ],
              "strides": [
                1,
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1,
                1
              ],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv3d_2",
            "inbound_nodes": [
              [
                [
                  "max_pooling3d_1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Conv3D",
            "config": {
              "name": "conv3d_5",
              "trainable": true,
              "dtype": "float32",
              "filters": 96,
              "kernel_size": [
                3,
                3,
                3
              ],
              "strides": [
                1,
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1,
                1
              ],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv3d_5",
            "inbound_nodes": [
              [
                [
                  "max_pooling3d_3",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Conv3D",
            "config": {
              "name": "conv3d_8",
              "trainable": true,
              "dtype": "float32",
              "filters": 96,
              "kernel_size": [
                3,
                3,
                3
              ],
              "strides": [
                1,
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1,
                1
              ],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv3d_8",
            "inbound_nodes": [
              [
                [
                  "max_pooling3d_5",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "AveragePooling3D",
            "config": {
              "name": "average_pooling3d",
              "trainable": true,
              "dtype": "float32",
              "pool_size": [
                3,
                3,
                3
              ],
              "padding": "valid",
              "strides": [
                3,
                3,
                3
              ],
              "data_format": "channels_last"
            },
            "name": "average_pooling3d",
            "inbound_nodes": [
              [
                [
                  "conv3d_2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "AveragePooling3D",
            "config": {
              "name": "average_pooling3d_1",
              "trainable": true,
              "dtype": "float32",
              "pool_size": [
                3,
                3,
                3
              ],
              "padding": "valid",
              "strides": [
                3,
                3,
                3
              ],
              "data_format": "channels_last"
            },
            "name": "average_pooling3d_1",
            "inbound_nodes": [
              [
                [
                  "conv3d_5",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "AveragePooling3D",
            "config": {
              "name": "average_pooling3d_2",
              "trainable": true,
              "dtype": "float32",
              "pool_size": [
                3,
                3,
                3
              ],
              "padding": "valid",
              "strides": [
                3,
                3,
                3
              ],
              "data_format": "channels_last"
            },
            "name": "average_pooling3d_2",
            "inbound_nodes": [
              [
                [
                  "conv3d_8",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Flatten",
            "config": {
              "name": "flatten",
              "trainable": true,
              "dtype": "float32",
              "data_format": "channels_last"
            },
            "name": "flatten",
            "inbound_nodes": [
              [
                [
                  "average_pooling3d",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Flatten",
            "config": {
              "name": "flatten_1",
              "trainable": true,
              "dtype": "float32",
              "data_format": "channels_last"
            },
            "name": "flatten_1",
            "inbound_nodes": [
              [
                [
                  "average_pooling3d_1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Flatten",
            "config": {
              "name": "flatten_2",
              "trainable": true,
              "dtype": "float32",
              "data_format": "channels_last"
            },
            "name": "flatten_2",
            "inbound_nodes": [
              [
                [
                  "average_pooling3d_2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Concatenate",
            "config": {
              "name": "concatenate_re",
              "trainable": true,
              "dtype": "float32",
              "axis": -1
            },
            "name": "concatenate_re",
            "inbound_nodes": [
              [
                [
                  "flatten",
                  0,
                  0,
                  {}
                ],
                [
                  "flatten_1",
                  0,
                  0,
                  {}
                ],
                [
                  "flatten_2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                3
              ],
              "dtype": "float32",
              "name": "pos"
            },
            "name": "pos",
            "inbound_nodes": []
          },
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                15
              ],
              "dtype": "float32",
              "name": "target"
            },
            "name": "target",
            "inbound_nodes": []
          },
          {
            "class_name": "Concatenate",
            "config": {
              "name": "concatenate_1_re",
              "trainable": true,
              "dtype": "float32",
              "axis": -1
            },
            "name": "concatenate_1_re",
            "inbound_nodes": [
              [
                [
                  "concatenate_re",
                  0,
                  0,
                  {}
                ],
                [
                  "pos",
                  0,
                  0,
                  {}
                ],
                [
                  "target",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense",
              "trainable": true,
              "dtype": "float32",
              "units": 128,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense",
            "inbound_nodes": [
              [
                [
                  "concatenate_1_re",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "dtype": "float32",
              "units": 64,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense_1",
            "inbound_nodes": [
              [
                [
                  "dense",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_2",
              "trainable": true,
              "dtype": "float32",
              "units": 3,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense_2",
            "inbound_nodes": [
              [
                [
                  "dense_1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          }
        ],
        "input_layers": [
          [
            "patch_s0",
            0,
            0
          ],
          [
            "patch_s1",
            0,
            0
          ],
          [
            "patch_s2",
            0,
            0
          ],
          [
            "pos",
            0,
            0
          ],
          [
            "target",
            0,
            0
          ]
        ],
        "output_layers": [
          [
            "dense_2",
            0,
            0
          ]
        ]
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "conv3d/kernel",
          "shape": [
            3,
            3,
            3,
            1,
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "conv3d/bias",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "conv3d_1/kernel",
          "shape": [
            3,
            3,
            3,
            32,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "conv3d_1/bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "conv3d_2/kernel",
          "shape": [
            3,
            3,
            3,
            64,
            96
          ],
          "dtype": "float32"
        },
        {
          "name": "conv3d_2/bias",
          "shape": [
            96
          ],
          "dtype": "float32"
        },
        {
          "name": "conv3d_3/kernel",
          "shape": [
            3,
            3,
            3,
            1,
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "conv3d_3/bias",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "conv3d_4/kernel",
          "shape": [
            3,
            3,
            3,
            32,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "conv3d_4/bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "conv3d_5/kernel",
          "shape": [
            3,
            3,
            3,
            64,
            96
          ],
          "dtype": "float32"
        },
        {
          "name": "conv3d_5/bias",
          "shape": [
            96
          ],
          "dtype": "float32"
        },
        {
          "name": "conv3d_6/kernel",
          "shape": [
            3,
            3,
            3,
            1,
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "conv3d_6/bias",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "conv3d_7/kernel",
          "shape": [
            3,
            3,
            3,
            32,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "conv3d_7/bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "conv3d_8/kernel",
          "shape": [
            3,
            3,
            3,
            64,
            96
          ],
          "dtype": "float32"
        },
        {
          "name": "conv3d_8/bias",
          "shape": [
            96
          ],
          "dtype": "float32"
        },
        {
          "name": "dense/kernel",
          "shape": [
            306,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "dense/bias",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/kernel",
          "shape": [
            128,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_2/kernel",
          "shape": [
            64,
            3
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_2/bias",
          "shape": [
            3
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}